Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/layers/cached.po
Languages: it_it

source: Cached Tiles
it_it: Tile in cache

source: By default, the WMS layer makes requests for 256 x 256 (pixel) images to fill your map viewport and beyond. As you pan and zoom around your map, more requests for images go out to fill the areas you haven't yet visited. While your browser will cache some requested images, a lot of processing work is typically required for the server to dynamically render images.
it_it: Di base i layer WMS effettuano richieste per immagini 256 x 256 (pixel) che riempiono il viewport della mappa ed anche oltre. Come effettuerete operazioni di pan e zoom sulla mappa ulteriori richieste di immagini vengono eseguite per riempire le aree che non sono state ancora visitate. Mentre il vostro browser riempirà la cache con alcune delle immagini richieste una grosse mole di lavoro viene contestualmente eseguita sul server per restituire dinamicamente le immagini.

source: Since tiled layers (such as the WMS layer) make requests for images on a regular grid, it is possible for the server to cache these image requests and return the cached result next time you (or someone else) visits the same area - resulting in better performance all around.
it_it: Dal momento che i layer di tile (come quelli WMS) effettuano richieste per immagini su una griglia regolare, è possibile per il server mettere in cache queste immagini e ritornare il risultato in cache la prossima volta che qualche altro visiterà la medesima area - ottenendo, in generale, il risultato di avere migliori performance globali.

source: The Web Map Service specification allows a lot of flexibility in terms of what a client can request. Without constraints, this makes caching difficult or impossible in practice.
it_it: Le specifiche Web Map Service permettono notevole flessibilità nei termini di ciò che un client può richiedere. Senza alcun vincolo ciò può complicare l'operazione di caching o addirittura renderla impossibile nella pratica.

source: At the opposite extreme, a service might offer tiles only at a fixed set of zoom levels and only for a regular grid. These can be generalized as XYZ layers - you can consider X and Y to indicate the column and row of the grid and Z to represent the zoom level.
it_it: All'esatto estremo, un servizio potrebbe offrire le tile solo ad un fissato gruppo di livelli di zoom e solo per una griglia regolare. Questo concetto può essere generalizzato come layer XYZ - è possibile considerare X e Y come indicanti la colonna e la riga della griglia e Z come rappresentante del livello di zoom.

source: The `OpenStreetMap (OSM) <http://www.openstreetmap.org/>`_ project is an effort to collect and make freely available map data for the world. OSM provides a few different renderings of their data as cached tile sets. These renderings conform to the basic :ref:`XYZ grid <openlayers.layers.cached.xyz>` arrangement and can be used in an OpenLayers map. The ``OpenLayers.Layer.OSM`` constructor accesses OpenStreetMap tiles.
it_it: Il progetto `OpenStreetMap (OSM) <http://www.openstreetmap.org/>`_ è uno sforzo della community per collezionare e rendere gratuitamente disponibile su mappa i dati del mondo intero. OSM prevede alcuni differenti tipi di restituzione dei loro dati sotto forma di tile in cache. Queste restituzioni sono conformi alla specifica di :ref:`griglia XYZ <openlayers.layers.cached.xyz>` e possono essere utilizzate in una mappa OpenLayers. Il costruttore ``OpenLayers.Layer.OSM`` non fa altro che accedere alle tile di OpenStreetMap.

source: Tasks
it_it: Attività

source: Open the ``map.html`` file from the :ref:`previous section <openlayers.layers.wms>` in a text editor and change the map initialization code to look like the following:
it_it: Aprire il file ``map.html`` dalla :ref:`precedente sezione <openlayers.layers.wms>` in un editor e modificare il codice di inizializzazione in maniera che risulti simile al seguente:

source: In the ``<head>`` of the same document, add a few style declarations for the layer attribution.
it_it: Nel markup ``<head>`` dello stesso documento aggiungere qualche dichiarazione di stile per l'attribuzione del layer.

source: Save your changes, and refresh the page in your browser: @workshop_url@/map.html
it_it: Salvare le modifiche e ricaricare la pagina nel browser: @workshop_url@/map.html

source: A map with an OpenStreetMap layer.
it_it: Una mappa con un layer OpenStreetMap.

source: A Closer Look
it_it: Uno sguardo da più vicino

source: Projections
it_it: Proiezioni

source: Review the first 3 lines of the initialization script:
it_it: Rivedere le prime 3 linee dello script di inizializzazione:

source: Geospatial data can come in any number of coordinate reference systems. One data set might use geographic coordinates (longitude and latitude) in degrees, and another might have coordinates in a local projection with units in meters. A full discussion of coordinate reference systems is beyond the scope of this module, but it is important to understand the basic concept.
it_it: I dati geospaziali possono essere forniti in un certo numero di sistemi di riferimento delle coordinate (CRS). Un insieme di dati potrebbe usare coordinate geografiche (longitudine e latitudine) in gradi, e un altro potrebbe avere coordinate in una proiezione locale con unità in metri. Un approfondimento completo sui sistemi di riferimento delle coordinate va oltre gli scopi di questo modulo, ma è importante capire i concetti di base.

source: OpenLayers needs to know the coordinate system for your data. Internally, this is represented with an ``OpenLayers.Projection`` object. The ``transform`` function also takes strings that represent the coordinate reference system (``"EPSG:4326"`` and ``"EPSG:3857"`` above).
it_it: OpenLayers ha bisogno di conoscere il sistema di coordinate per i dati. Internamente, questo è rappresentato con un oggetto ``OpenLayers.Projection``. La funzione ``transform`` anch'essa prende stringhe che rappresentano il sistema di riferimento delle coordinate

source: Locations Transformed
it_it: Posizioni trasformate

source: The OpenStreetMap tiles that we will be using are in a Mercator projection. Because of this, we need to set the initial center using Mercator coordinates. Since it is relatively easy to find out the coordinates for a place of interest in geographic coordinates, we use the ``transform`` method to turn geographic coordinates (``"EPSG:4326"``) into Mercator coordinates (``"EPSG:3857"``).
it_it: I tile di OpenStreetMap che saranno utilizzati sono nella proiezione Mercator. Per questo abbiamo bisogno di impostare il centro della mappa iniziale usando le coordinate di quel sistema di proiezione. Dal momento che è relativamente facile individuare le coordinate per un punto di interesse in coordinate geografiche useremo il metodo di trasformazione ``transform`` per convertirle da (``"EPSG:4326"``) nel corrispondente codice Mercator (``"EPSG:3857"``).

source: Custom Map Options
it_it: Opzioni di mappa personalizzate

source: In the :ref:`previous example <openlayers.layers.wms.example>` we used the default options for our map. In this example, we set a custom map projection.
it_it: Nel :ref:`precedente esempio <openlayers.layers.wms.example>` utilizzavamo le opzioni di base per la nostra mappa. In questo esempio imposteremo delle proiezioni personalizzate.

source: The projections we used here are the only projections that OpenLayers knows about. For other projections, the map options need to contain two more properties: ``maxExtent`` and ``units``. This information can be looked up at http://spatialreference.org/, using the EPSG code.
it_it: Le proiezioni che utilizzeremo qui sono solo quelle conosciute alla libreria OpenLayers. Per altre proiezioni, le opzioni di mappa devono contenere due proprietà in più: ``maxExtent`` e ``units``. Queste informazioni possono essere consultate al sito http://spatialreference.org/ utilizzando il corrispettivo codice EPSG.

source: Layer Creation and Map Location
it_it: Creazione del layer e posizione della mappa

source: As before, we create a layer and add it to our map. This time, we accept all the default options for the layer.
it_it: Come prima creiamo un layer e lo aggiungiamo alla nostra mappa. Questa volta accettiamo di prendere tutte le opzioni di base per il layer.

source: Finally, we give our map a center (in Mercator coordinates) and set the zoom level to ``9``.
it_it: Infine diamo alla nostra mappa un centro (in coordinate Mercator) e impostiamo il livello di zoom a ``9``.

source: Style
it_it: Stile

source: A treatment of map controls is also outside the scope of this module, but these style declarations give you a sneak preview. By default, an ``OpenLayers.Control.Attribution`` control is added to all maps. This lets layers display attribution information in the map viewport. The declarations above alter the style of this attribution for our map (notice the small Copyright line at the bottom left of the map).
it_it: Un approfondimento dei controlli della mappa va oltre lo scopo di questo modulo, ma queste dichiarazioni di stile ci danno una veloce anteprima. Di base un controllo ``OpenLayers.Control.Attribution`` viene aggiunto a tutte le mappe. Ciò permette di visualizzare le informazioni di attribuzione del layer nel viewport della mappa. Le direttive sopra modificano lo stile di questa attribuzione per la nostra mappa (notate il piccolo Copyright in basso a sinistra).

source: Having mastered layers with publicly available cached tile sets, let's move on to working with :ref:`proprietary layers <openlayers.layers.proprietary>`.
it_it: Dopo aver imparato a trattare i layer con servizi di tile in cache disponibili pubblicamente, spostiamoci sui :ref:`layer proprietari <openlayers.layers.proprietary>`.
