Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/layers/proprietary.po
Languages: it_it

source: Proprietary Layers
it_it: Layer proprietari

source: In previous sections, we displayed layers based on a standards compliant :abbr:`WMS (OGC Web Map Service)` and a custom tile cache. Online mapping (or at least the tiled map client) was largely popularized by the availability of proprietary map tile services. OpenLayers provides layer types that work with these proprietary services through their APIs.
it_it: Nella sezione precedente abbiamo visualizzato layer basati sugli standard conformi con :abbr:`WMS (OGC Web Map Service)` e la cache di dati tassellati. Le mappe online (o almeno i client di mappe a tasselli) sono divenute largamente popolari grazie alla disponibilità di servizi di tile proprietari. OpenLayers fornisce dei tipi di layer attraverso le sue API che sono in grado di lavorare con questi servizi.

source: In this section, we'll build on the example developed in the :ref:`previous section <openlayers.layers.cached.example>` by adding a layer using tiles from Bing, and we'll toss in a layer switcher so you can decide which layers you want visible.
it_it: In questa sezione costruiremo sulla base dell'esempio sviluppato nella :ref:`precedente sezione <openlayers.layers.cached.example>` un'estensione della mappa aggiungendo layer di tile da Bing e aggiungeremo un selettore di layer in modo che l'utente possa decidere quale layer rendere visibile.

source: Let's add a Bing layer.
it_it: Aggiungiamo un layer Bing.

source: Tasks
it_it: Attività

source: In your ``map.html`` file, find where the :abbr:`OSM (OpenStreetMap)` layer is added in the map initialization code. Below the ``map.addLayer(osm);`` line, add the following:
it_it: Nel nostro file ``map.html`` cercate dove è stato inserito il layer :abbr:`OSM (OpenStreetMap)`. Sotto alla linea ``map.addLayer(osm);`` aggiungere il seguente pezzo di codice:

source: The Bing tiles API requires that you register for an API key to use with your mapping application. The example here uses an API key that you should not use in production. To use the Bing layer in production, register for an API key at https://www.bingmapsportal.com/.
it_it: Le API del servizio di tile Bing richiedono che siate registrati e acquisiate una chiave per utilizzarle nella vostra applicazione. L'esempio riportato sotto utilizza una chiave API che non dovrebbe essere utilizzata in un ambiente di produzione. Per usufruire del layer Bing in produzione, per favore registratevi e richiedete una chiave all'indirizzo https://www.bingmapsportal.com/.

source: Now that we have more than one layer in our map, it is time to add a layer switcher that controls layer visibility. Somewhere in your map initialization code (below the part where we create the ``map``), include the following to create a layer switcher and add it to the map:
it_it: Ora che abbiamo più di un layer nella nostra mappa è arrivato il momento di aggiungere un controllo che permetta di selezionare la visibilità dei layer. Andando sempre nel codice di inizializzazione della mappa (sotto alla parte dove creiamo ``map``), includiamo la seguente porzione di codice per creare uno switch dei layer e aggiungerlo alla mappa:

source: Save your changes and reload ``map.html`` in your browser: @workshop_url@/map.html
it_it: Salvare le modifiche e ricaricare il file ``map.html`` nel browser: @workshop_url@/map.html

source: Open the Layer Switcher at the upper right-hand corner of the map view, and select "Bing Roads".
it_it: Aprire il Layer Switcher sull'angolo in alto a destra della mappa e selezionare "Bing Roads".

source: A map with a bing layer and OpenStreetMap tiles.
it_it: Una mappa con i tile di un layer Bing e OpenStreetMap.

source: Complete Working Example
it_it: Esempio funzionante completo

source: Your revised ``map.html`` file should look something like this:
it_it: La revisione del file ``map.html`` dovrebbe assomigliare a qualcosa del genere:

source: Next we'll move on from raster layers and begin working with :ref:`vector layers <openlayers.layers.vector>`.
it_it: Ora spostiamoci dalla trattazione dei layer raster per lavorare con i :ref:`layer vettoriali <openlayers.layers.vector>`.
