Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/layers/vector.po
Languages: it_it

source: Vector Layers
it_it: Layer vettoriali

source: Previous sections in this module have covered the basics of raster layers with OpenLayers. This section deals with vector layers - where the data is rendered for viewing in your browser.
it_it: Nella sezione precedente di questo modulo abbiamo descritto i concetti base dei layer raster in OpenLayers. In questa tratteremo i layer vettoriali - dove i dati restituiti nel vostro browser sono di natura strutturata.

source: OpenLayers provides facilities to read existing vector data from the server, make modifications to feature geometries, and determine how features should be styled in the map.
it_it: OpenLayers prevede delle capacità di leggere dati vettoriali esistenti sul server, apportare modifiche alle geometrie delle feature, e determinare come le feature dovrebbero essere stilizzate nella mappa.

source: Though browsers are steadily improving in terms of JavaScript execution speed (which helps in parsing data), there are still serious rendering bottlenecks which limit the quantity of data you'll want to use in practice. The best advice is to try your application in all the browsers you plan to support, to limit the data rendered client side until performance is acceptable, and to consider strategies for effectively conveying information without swamping your browser with too many vector features (the technical vector rendering limits of your browser often match the very real limitations of your users to absorb information).
it_it: Sebbene i browser siano fermamente migliorati in termini di velocità di esecuzione di JavaScript (cosa che aiuta ad interpretare i dati), esistono ancora serie ragioni legate ad attese inaspettate nella restituzione che limitano la quantità di dati che si vuole usare nella pratica. Il consiglio migliore è di provare la vostra applicazione in tutti i browser che desiderate supportare per limitare i dati restituiti sul client finché le performance non siano accettabili, e di prendere in considerazione strategie per effettivamente distribuire le informazioni senza riempire il vostro browser con troppe feature vettoriali (I limiti tecnici del browser nella restituzione dei vettoriali spesso collimano con la più reale limitazione degli utenti ad assorbirle).

source: Rendering Features Client-Side
it_it: Restituzione delle feature sul client

source: Let's go back to the :ref:`WMS example <openlayers.layers.wms.example>` to get a basic world map. We'll add some feature data on top of this in a vector layer.
it_it: Torniamo indietro all':ref:`esempio del WMS <openlayers.layers.wms.example>` per avere la nostra mappa base del mondo. Vi aggiungeremo alcune feature provenienti da un layer vettoriale.

source: Tasks
it_it: Attività

source: Open ``map.html`` in your text editor and copy in the contents of the initial :ref:`WMS example <openlayers.layers.wms.example>`. Save your changes and confirm that things look good in your browser: @workshop_url@/map.html
it_it: Aprire il file ``map.html`` nel vostro editor di testo e copiarci il contenuto dell':ref:`esempio WMS <openlayers.layers.wms.example>` iniziale. Salvare le modifiche e verificare che tutto funzioni correttamente nel vostro browser: @workshop_url@/map.html

source: In your map initialization code (anywhere after the ``map`` construction), paste the following. This adds a new vector layer to your map that requests a set of features stored in GeoRSS:
it_it: Nel vostro codice di inizializzazione della mappa (da qualche parte dopo la costruzione di ``map``) incollare il codice sotto. Questo aggiunge un nuovo layer vettoriale alla vostra mappa che richiede un insieme di feature memorizzare nel formato GeoRSS:

source: World map with orange circles representing earthquake locations.
it_it: Una mappa del mondo con cerchi arancioni che rappresentano le posizioni di terremoti.

source: A Closer Look
it_it: Uno sguardo più da vicino

source: Let's examine that vector layer creation to get an idea of what is going on.
it_it: Vediamo di esaminare la creazione del layer vettoriale per avere un'idea di come avvenga.

source: The layer is given the title ``"Earthquakes"`` and some custom options. In the options object, we've included a list of ``strategies`` and a ``protocol``. A full discussion of strategies and protocols is beyond the scope of this module, but here is a rough sketch of what they do:
it_it: Al layer è attribuito il titolo ``"Earthquakes"`` e alcune altre opzioni custom. Nell'oggetto options abbiamo incluso una lista di ``strategies`` e un ``protocol``. Una digressione completa su cosa significhino strategies e protocol va troppo oltre lo scopo di questo modulo, ma qui sotto vi presentiamo brevemente ciò che fanno:

source: Strategies determine when your data is requested and how to handle that data once it has been turned into features. Strategies can also be used to trigger an update of your data when something has been modified. Strategies are ordered and independent--they can work with the results of a previous strategy, but they can't rely on other strategies being there.
it_it: Strategy determina quando il dato è richiesto e come debba essere trattato una volta che è stato trasformato in feature. Lo Strategy può anche essere usato per scatenare un aggiornamento del dato quando qualcosa è stato modificato. Esse sono acquisite e indipendenti--possono funzionare con i risultati di una precedente Strategy ma non possono affidarsi ad altre già presenti.

source: Protocols refer to communication protocols between client and server for reading and writing feature data. Protocols may have a format (parser) that is responsible for serializing and deserializing feature data.
it_it: Protocol si riferisce ai protocolli di comunicazione tra client e server per leggere e scrivere i dati delle feature. I protocolli possono avere un formato (parser) che è responsabile della serializzazione e de-serializzazione dei dati relativi alle feature.

source: In this case, we're using a fixed strategy. The fixed strategy triggers a single request for data and doesn't ever ask for updates. We're asking for data using the HTTP protocol, we provide the URL for the data, and we expect the features to be serialized as GeoRSS.
it_it: In questo caso stiamo utilizzando una Strategy fissa. Essa scatena una singola richiesta di dati e non chiede mai aggiornamenti. Semplicemente stiamo chiedendo i dati utilizzando il protocollo HTTP, forniamo una URL per ritrovarli e ci aspettiamo delle feature che siano serializzate come GeoRSS.

source: Bonus Tasks
it_it: Attività bonus

source: The orange circles on the map represent ``OpenLayers.Feature.Vector`` objects on your ``OpenLayers.Layer.Vector`` layer. Each of these features has attribute data with ``title``, ``description``, and ``link`` properties. Add an ``OpenLayers.Control.SelectFeature`` control to your map, listen for the ``featureselected`` event on the vector layer, and display earthquake information below the map viewport.
it_it: I cerchi arancioni sulla mappa rappresentano oggetti di tipo ``OpenLayers.Feature.Vector`` sul vostro layer ``OpenLayers.Layer.Vector``. Ognuna di queste feature ha dati associati con le proprietà ``title``, ``description``, e ``link``. Aggiungete un controllo ``OpenLayers.Control.SelectFeature`` alla mappa, un listener per l'evento ``featureselected`` sul layer vettoriale e visualizzerete le informazioni sul terremoto nel viewport della mappa.

source: Continuing on with the above task, use one of the ``OpenLayers.Popup`` classes to display feature information in a popup on the map. The popup should open on feature selection and close when a feature is unselected.
it_it: Continuando con l'esercizio di prima, provate ad utilizzare le classi ``OpenLayers.Popup`` per visualizzare informazioni relative alle feature in un popup sulla mappa. Il popup si aprirà alla selezione della feature e si chiuderà quando la feature è non selezionata.

source: The data for the vector layer comes from an earthquake feed published by the USGS (http://earthquake.usgs.gov/earthquakes/catalogs/). See if you can find additional data with spatial information in GeoRSS or another OpenLayers supported format. If you save another feed (or other document) representing spatial data in your ``data`` directory, you should be able to view it in a vector layer on your map.
it_it: I dati per il layer vettoriale provengono dalla pubblicazione del catalogo sui terremoti da parte di USGS (http://earthquake.usgs.gov/earthquakes/catalogs/). Provate a vedere se trovate altri dati con informazioni spaziali in GeoRSS o in un altro formato supportato da OpenLayers. Se salvate un altro file di dati (o un altro documento) rappresentante dati spaziali nella directory ``data``, dovreste essere in grado di visualizzarlo in un layer vettoriale della mappa.
