Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/vector/concepts.po
Languages: it_it

source: Working with Vector Layers
it_it: Lavorare con layer vettoriali

source: The base ``OpenLayers.Layer.Vector`` constructor provides a fairly flexible layer type. By default, when you create a new vector layer, no assumptions are made about where the features for the layer will come from. In addition, a very basic style is applied when rendering those features. Customizing the rendering style is addressed in an :ref:`upcoming section <openlayers.vector.style-intro>`. This section introduces the basics of vector data :ref:`formats <openlayers.vector.basics.format>`, the :ref:`protocols <openlayers.vector.basics.protocol>` used to read and write feature data, and various :ref:`strategies <openlayers.vector.basics.strategy>` for engaging with those protocols.
it_it: Il costruttore base ``OpenLayers.Layer.Vector`` prevede un tipo di layer flessibile. Di base, quando si crea un nuovo layer vettoriale, non viene fatta alcuna assunzione circa la provenienza delle feature per un layer. Inoltre viene applicato uno stile veramente minimale quando esse vengono restituite. La personalizzazione della vestizione è un argomento affrontato nella :ref:`prossima sezione <openlayers.vector.style-intro>`. Questa sezione introduce i concetti base dei :ref:`formati <openlayers.vector.basics.format>` di dati vettoriali, i :ref:`protocolli<openlayers.vector.basics.protocol>` utilizzati per leggere e scrivere i dati delle feature, e varie :ref:`strategie <openlayers.vector.basics.strategy>` per districarsi con quei protocolli.

source: In dealing with vector layers and features, it is somewhat useful to consider a postal analogy. When writing a letter, you have to know some of the rules imposed by the postal service, such as how addresses are formatted or what an envelope can contain. You also have to know something about your recipient: primarily what language they speak. Finally, you have to make a decision about when to go to the post office to send your letter. Having this analogy in mind may help in understanding the concepts below.
it_it: Nel trattare con layer e feature vettoriali è in qualche modo utile tirare in ballo un analogia con un esempio delle poste. Quando si scrive una lettera, è obbligatorio conoscere alcune delle regole imposte dal servizio postale, come per esempio la formattazione degli indirizzi o cosa può contenere una busta delle lettere. Devi conoscere anche qualcosa riguardo al tuo destinatario, ad esempio in primis quale lingua parla. Infine, devi prendere la decisione su quando andare all'ufficio postale per inviare la tua lettera. Avere questa analogia in mente vi aiuterà a capire qualcuno dei concetti che descrivere sotto.

source: The ``OpenLayers.Format`` classes in OpenLayers are responsible for parsing data from the server representing vector features. Following the postal analogy, the format you choose is analogous to the language in which you write your letter. The format turns raw feature data into ``OpenLayers.Feature.Vector`` objects. Typically, format is also responsible for reversing this operation.
it_it: Le classi ``OpenLayers.Format`` in OpenLayers sono responsabili di effettuare il parsing dei dati provenienti dal server che rappresentano le feature vettoriali. Tornando all'esempio di prima il formato scelto è analogo al linguaggio nel quale si dovrebbe scrivere la lettera. Il formato converte le feature grezze in oggetti di tipo ``OpenLayers.Feature.Vector``. Tipicamente il formato è anche responsabile dell'operazione inversa.

source: Consider the two blocks of data below. Both represent the same ``OpenLayers.Feature.Vector`` object (a point in Barcelona, Spain). The first is serialized as `GeoJSON <http://geojson.org>`_ (using the ``OpenLayers.Format.GeoJSON`` parser). The second is serialized as :abbr:`GML (OGC Geography Markup Language)` (using the ``OpenLayers.Format.GML.v3`` parser).
it_it: Considerate i due blocchi di dati riportati sotto. Entrambi rappresentano lo stesso oggetto ``OpenLayers.Feature.Vector`` (un punto a Barcellona, Spagna). Il primo è sterilizzato come `GeoJSON <http://geojson.org>`_ (usando il parser ``OpenLayers.Format.GeoJSON``). Il secondo invece è sterilizzato come :abbr:`GML (OGC Geography Markup Language)` (usando il parser ``OpenLayers.Format.GML.v3``).

source: GeoJSON Example
it_it: Esempio GeoJSON

source: GML Example
it_it: Esempio GML

source: See the `vector formats <http://openlayers.org/dev/examples/vector-formats.html>`_ example for a demonstration of translation between a few OpenLayers formats.
it_it: Vedere i `formati vettoriali <http://openlayers.org/dev/examples/vector-formats.html>`_ esempio per una dimostrazione di traduzione tra alcuni formati OpenLayers.

source: The ``OpenLayers.Protocol`` classes refer to specific communication protocols for reading and writing vector data. A protocol instance may have a reference to a specific ``OpenLayers.Format``. So, you might be working with a service that communicates via HTTP and deals in GeoJSON features. Or, you might be working with a service that implements :abbr:`WFS (OGC Web Feature Service)` and deals in :abbr:`GML (OGC Geography Markup Language)`. In these cases you would construct an ``OpenLayers.Protocol.HTTP`` with a reference to an ``OpenLayers.Format.GeoJSON`` object or an ``OpenLayers.Protocol.WFS`` with a reference to an ``OpenLayers.Format.GML`` object.
it_it: Le classi ``OpenLayers.Protocol`` si riferiscono ai protocolli di comunicazione specifici per leggere e scrivere dati vettoriali. L'istanza di un protocollo può avere un riferimento ad uno specifico formato ``OpenLayers.Format``. Perciò, per esempio, potreste voler lavorare con un servizio che comunica in HTTP e tratta le feature come GeoJSON. Altresì, potrebbe essere richiesto di lavorare con un servizio che implementa il :abbr:`WFS (OGC Web Feature Service)` e tratta i dati in :abbr:`GML (OGC Geography Markup Language)`. In questi casi userete un costrutto ``OpenLayers.Protocol.HTTP`` con un riferimento ad un oggetto ``OpenLayers.Format.GeoJSON`` oppure un ``OpenLayers.Protocol.WFS`` con un riferimento ad un oggetto ``OpenLayers.Format.GML``.

source: Back on the postal analogy, the protocol is akin to the rules about how an envelope must be addressed. Ideally, a protocol doesn't specify anything about the format of the content being delivered (the post office doesn't care about the language used in a letter; ideally, they only need to read the envelope).
it_it: Tornando alla nostra analogia, il protocollo chiede di conoscere le regole su come debba essere indirizzata una lettera. Idealmente un protocollo non dovrebbe specificare nulla sul formato del contenuto che viene consegnato (l'ufficio postale non può sapere in che linguaggio è scritta la lettera, l'unica cosa di cui ha bisogno è leggere l'esterno della busta).

source: Neither protocols nor formats are explicitly tied to an ``OpenLayers.Layer.Vector`` instance. The layer provides a view of the data for the user, and the protocol shouldn't have to bother itself about that view.
it_it: Quindi ne i protocolli ne i formati sono esplicitamente connessi ad un istanza ``OpenLayers.Layer.Vector``. Il layer provvede con una vista dei dati per l'utente e il protocollo non dovrebbe dover prestarsi a contorno di quella vista.

source: Loosely speaking, the ``OpenLayers.Strategy`` classes tie together the layer and the protocol. Strategies deal with `when` to make requests for data (or `when` to send modifications). Strategies can also determine `how` to prepare features before they end up in a layer.
it_it: Volendo aggiungere una piccola digressione, possiamo dire che le classi ``OpenLayers.Strategy`` mettono insieme il layer con il protocollo. Esse gestiscono il `quando` effettuare la richiesta per i dati (o il `quando` inviare le modifiche) e possono anche determinare `come` preparare le feature prima che finiscano nel layer.

source: The ``OpenLayers.Strategy.BBOX`` strategy says "request new features whenever the map bounds are outside the bounds of the previously requested set of features."
it_it: La strategy ``OpenLayers.Strategy.BBOX`` dice "richiedi nuove feature non appena i limiti della mappa sono fuori dai limiti del precedente insieme di feature richiesto."

source: The ``OpenLayers.Strategy.Cluster`` strategy says "before passing any new features to the layer, clump them together in clusters based on proximity to other features."
it_it: La strategy ``OpenLayers.Strategy.Cluster`` dice "prima di passare qualsiasi nuova feature al layer, accorpale insieme in cluster sulla base della loro vicinanza ad altre feature."

source: In creating a vector layer, you choose the mix: one protocol (typically) with a reference to one format, and any number of strategies. And, all of this is optional. You can very well create a vector layer `without` protocol or strategies and manually make requests for features, parse those features, and add them to the layer.
it_it: Nella creazione di un layer vettoriale sceglierai un mix: un protocollo (tipicamente) che si riferisca ad un formato, e un certo numero di strategie. E tutto questo è opzionale. Potresti sempre creare molto bene un layer vettoriale `senza` protocollo o strategie ed effettuare manualmente richieste per feature, il parsing di quelle feature e infine aggiungerle al layer.

source: Having dispensed with the basics of formats, protocols, and strategies, we're ready to start :ref:`creating new features <openlayers.vector.draw>`.
it_it: Dopo aver imparato i fondamenti di formati, protocolli, e strategie, siamo pronti a :ref:`creare nuove feature <openlayers.vector.draw>`.
