Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/vector/draw.po
Languages: it_it

source: Creating New Features
it_it: Creare nuove feature

source: OpenLayers provides controls for drawing and modifying vector features. The ``OpenLayers.Control.DrawFeature`` control can be used in conjunction with an ``OpenLayers.Handler.Point``, an ``OpenLayers.Handler.Path``, or an ``OpenLayers.Handler.Polygon`` instance to draw points, lines, polygons, and their multi-part counterparts. The ``OpenLayers.Control.ModifyFeature`` control can be used to allow modification of geometries for existing features.
it_it: OpenLayers prevede dei controlli per disegnare e modificare feature vettoriali. Il controllo ``OpenLayers.Control.DrawFeature`` può essere utilizzato congiuntamente a ``OpenLayers.Handler.Point``, ``OpenLayers.Handler.Path``, o ad un'istanza di ``OpenLayers.Handler.Polygon`` per disegnare punti, linee e poligoni e loro eventuali multi parti. Il controllo ``OpenLayers.Control.ModifyFeature``può essere usato proprio per lo scopo di modificare la geometria di feature esistenti.

source: In this section, we'll add a control to the map for drawing new polygon features. As with the other examples in this workshop, this is not supposed to be a complete working application--as it does not allow editing of attributes or saving of changes. We'll take a look at persistence in the :ref:`next section <openlayers.vector.persist>`.
it_it: In questa sezione aggiungeremo alla mappa un controllo che permette di disegnare nuove feature di tipo poligonale. Come per il resto degli esempi nel workshop questo non può essere considerato alla stregua di un'applicazione completa--e noterete che non consente l'editing degli attributi e il salvataggio delle modifiche. Daremo uno sguardo a tutto ciò nella :ref:`prossima sezione <openlayers.vector.persist>` riguardante la persistenza.

source: Tasks
it_it: Attività

source: We'll start with a working example that displays building footprints in a vector layer over a base layer. Open your text editor and save the following as ``map.html`` in the root of your workshop directory:
it_it: Inizieremo con un esempio che visualizza le sezioni degli edifici in un layer vettoriale sovrapposto ad uno di base. Aprire un editor di testo e salvare come ``map.html`` il seguente blocco di codice nella radice della directory del workshop:

source: Open this ``map.html`` example in your browser to confirm that buildings are displayed over the base layer: @workshop_url@/map.html
it_it: Aprire questo ``map.html`` di esempio nel vostro browser e verificare che gli edifici vengano visualizzati sopra al layer di base: @workshop_url@/map.html

source: To this example, we'll be adding a control to draw features. In order that users can also navigate with the mouse, we don't want this control to be active all the time. We need to add some elements to the page that will allow for control activation and deactivation. In the ``<body>`` of your document, add the following markup. (Placing it right after the map viewport element ``<div id="map-id"></div>`` makes sense.):
it_it: In questo esempio aggiungeremo un controllo che disegna le feature. Per far si che gli utenti possano anche navigare con il mouse non vogliamo che questo controllo resti attivo tutto il tempo. Per far questo abbiamo bisogno di aggiungere alcuni elementi alla pagina che permettano l'attivazione e la disattivazione del controllo. Nel ``<body>`` del vostro documento aggiungete il seguente blocco di HTML. (Posizionarlo proprio sotto all'elemento viewport ``<div id="map-id"></div>`` avrebbe un certo senso.):

source: Now we'll create an ``OpenLayers.Control.DrawFeature`` control to add features to the buildings layer. We construct this layer with an ``OpenLayers.Handler.Polygon`` to allow drawing of polygons. In your map initialization code, add the following somewhere after the creation of the ``buildings`` layer:
it_it: A questo punto creeremo un controllo ``OpenLayers.Control.DrawFeature`` per aggiungere feature al layer degli edifici. Costruiremo questo layer con un oggetto ``OpenLayers.Handler.Polygon`` per consentirne il disegno di poligoni. Nel codice di inizializzazione della mappa aggiungerete da qualche parte dopo la creazione del layer ``buildings`` il seguente blocco:

source: Finally, we'll add behavior to the ``<input>`` element in order to activate and deactivate the draw control when the user clicks the checkbox. We'll also call the ``toggle`` function when the page loads to synchronize the checkbox and control states. Add the following to your map initialization code:
it_it: Infine aggiungeremo anche un determinato comportamento all'elemento ``<input>`` per permettere di attivare e disattivare il controllo sul disegno quando l'utente fa click sulla checkbox. Inoltre chiameremo anche la funzione ``toggle`` quando la pagina si carica in modo da sincronizzare la checkbox e il controllo dello stato. Inserite il blocco di codice seguente all'inizializzazione della mappa:

source: Save your changes and reload ``map.html`` in your browser: @workshop_url@/map.html
it_it: Salvare le modifiche e ricaricare la pagina ``map.html`` nel vostro browser: @workshop_url@/map.html

source: A control for adding features to a vector layer.
it_it: Un controllo per aggiungere feature ad un layer vettoriale.
