Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/vector/persist.po
Languages: it_it

source: Persisting Features
it_it: Feature persistenti

source: Persistence of vector feature data is the job of an ``OpenLayers.Protocol``. The :abbr:`WFS (OGC Web Feature Service)` specification defines a protocol for reading and writing feature data. In this section, we'll look at an example that uses an ``OpenLayers.Protocol.WFS`` instance with a vector layer.
it_it: La persistenza dei dati di una feature vettoriale è un lavoro che viene svolto dall'oggetto ``OpenLayers.Protocol``. Infatti le specifiche :abbr:`WFS (OGC Web Feature Service)` definiscono un protocollo per leggere e scrivere i dati. In questa sezione daremo uno sguardo ad un esempio che usa un istanza di ``OpenLayers.Protocol.WFS`` con un layer vettoriale.

source: A full-fledged editing application involves more user interaction (and GUI elements) than is practical to demonstrate in a short example. However, we can add an ``OpenLayers.Control.Panel`` to a map that accomplishes a few of the basic editing tasks.
it_it: Una completa e matura applicazione per l'editing oltre a richiedere molti più add-on ed elementi di user interface sarebbe anche poco pratica da dimostrare con un pisolo esempio. Comunque procederemo con l'aggiunta di un oggetto ``OpenLayers.Control.Panel`` alla mappa che permette di eseguire alcune attività di base per la modifica delle feature.

source: Tasks
it_it: Attività

source: Open your text editor and paste in the text from the start of the :ref:`previous section <openlayers.vector.draw.example>`. Save this as ``map.html``.
it_it: Aprire il vostro editor di testo e incollare dall'inizio il blocco della :ref:`precedente sezione <openlayers.vector.draw.example>`. Salvare il file come ``map.html``.

source: OpenLayers doesn't provide controls for deleting or saving features. The ``extras`` folder in this workshop includes code for those controls bundled together in a control panel. These controls are specific to editing a vector layer with multipolygon geometries, so they will work with our buildings example. In the ``<head>`` of your ``map.html`` document, **after** the OpenLayers script tag, insert the following to pull in the required code and stylesheet for the controls:
it_it: OpenLayers non prevede controlli per cancellare o salvare le feature. La cartella ``extras`` di questo workshop incorpora il codice per assemblare insieme questo tipo di controlli in un pannello. Questi controlli sono specifici per l'editing dei layer vettoriali con geometrie di tipo MultiPolygon cosicché possa funzionare con l'esempio degli edifici che stiamo utilizzando sin dall'inizio. Nel tag di markup ``<head>`` del nostro documento ``map.html``, **dopo** quello di inserimento dello script OpenLayers, inserire il seguente blocco per richiamare il codice richiesto ed i fogli di stile dei controlli:

source: Now we'll give the ``buildings`` layer an ``OpenLayers.Strategy.Save``. This strategy is designed to trigger commits on the protocol and deal with the results. The ``buildings`` layer currently has a single strategy. Modify the layer creation code to include another:
it_it: A questo punto daremo al layer ``buildings`` una strategy di salvataggio ``OpenLayers.Strategy.Save``. Questa strategia è stata progettata per intercettare eventuali commit sul protocollo e gestire i risultati. Al momento il layer ``buildings`` possiede una singola strategia. Modificare il codice della creazione del layer per includerne un'altra:

source: Finally, we'll create the editing panel and add it to the map. Somewhere in your map initialization code after creating the ``buildings`` layer, insert the following:
it_it: Infine creeremo il pannello di editing e lo aggiungeremo alla mappa. Da qualche parte nel codice di inizializzazione della mappa, dopo la creazione del layer ``buildings``, inserite il seguente blocco di codice:

source: Now save your changes and load ``map.html`` in your browser: @workshop_url@/map.html
it_it: Dopodiché salvare e ricaricare la pagina ``map.html`` nel browser: @workshop_url@/map.html

source: Modifying a building footprint.
it_it: Modificare la sezione di un edificio
