Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/integration/ext-slider.po
Languages: it_it

source: The Ext JS Slider
it_it: Lo slider ExtJS

source: As with the jQuery sliders, an Ext slider provides a widget for collecting a user supplied value within some range. This exercise will duplicate the functionality put together in the :ref:`jQuery UI slider <openlayers.integration.jqui-slider>` section above.
it_it: Come nel caso degli sliders jQuery, quello Ext fornisce un widget per collezionare il valore fornito dall'utente all'interno di un certo range. In questo esercizio duplicheremo la funzionalità creata nello :ref:`slider jQuery UI <openlayers.integration.jqui-slider>` della sezione di prima.

source: The configuration for Ext widgets is extremely flexible. One way to create a slider widget is to start with a DOM element that will serve as the slider container.
it_it: La configurazione per i widget Ext è estremamente flessibile. Un modo di creare un widget dello slider è iniziare con un elemento DOM che servirà da contenitore dello stesso.

source: Given the above, the following code creates a functioning Ext slider.
it_it: In base a quanto detto sopra il codice seguente crea la funzionalità dello slider Ext.

source: We'll use the above technique to create a slider for controlling layer opacity.
it_it: Useremo la tecnica di prima per creare lo slider che controlli l'opacità del layer.

source: Using a Slider to Control Layer Opacity
it_it: Usare uno slider per controllare l'opacità del layer

source: We'll start with a working example that displays one :abbr:`WMS (OGC Web Map Service)` layer and one vector layer with features from a :abbr:`WFS (OGC Web Feature Service)`.
it_it: Inizieremo con un esempio funzionante che visualizza un layer :abbr:`WMS (OGC Web Map Service)` e un vettoriale con feature provenienti da un :abbr:`WFS (OGC Web Feature Service)`.

source: Tasks
it_it: Attività

source: Open your text editor and paste in the code used at the `start` of the :ref:`previous slider example <openlayers.integration.jqui-slider.example>`. Save this as ``map.html`` in the root of your workshop directory.
it_it: Aprire un editor di testo e incollare il codice utilizzato all'`inizio` dell':ref:`esempio dello slider precedente <openlayers.integration.jqui-slider.example>`. Salvare come ``map.html`` nella radice della directory del workshop.

source: Next we need to pull in the Ext resources that our widget will require. Add the following markup to the ``<head>`` of your ``map.html`` document:
it_it: Successivamente abbiamo bisogno di importare le risorse Ext che saranno richieste dal nostro widget. Aggiungere il seguente blocco HTML nella parte ``<head>`` del documento ``map.html``:

source: Now we'll create some markup that will create a container for the slider widget. In the ``<body>`` of your ``map.html`` file, just after the map viewport, insert the following:
it_it: A questo punto creeremo un blocco di codice HTML che costruirà un contenitore per il widget dello slider. Nel ``<body>`` del file ``map.html``, proprio dopo il viewport della mappa, inserire il codice seguente:

source: One bit of preparation before finalizing the code is to style the slider container. In this case, we'll make it as wide as the map and give it some margin. Insert the following style declarations into the ``<style>`` element within the ``<head>`` of your document:
it_it: Prima di ultima il codice possiamo corredarlo con un minimo di stile per il contenitore dello slider. in questo caso lo faremo grande quanto la mappa e gli daremo un certo margine. Inserire la seguente dichiarazione di stile nell'elemento ``<style>`` all'interno del markup ``<head>`` del vostro documento:

source: Somewhere in your map initialization code, add the following to create a slider in the container element and set up the slider listener to change layer opacity:
it_it: In qualche parte del codice di inizializzazione della mappa, aggiungere il blocco di codice sotto per creare uno slider nell'elemento del contenitore e impostare un listener per cambiare l'opacità dello slider:

source: Save your changes to ``map.html`` and open the page in your browser: @workshop_url@/map.html
it_it: Salvare le modifiche al file ``map.html`` e aprire la pagina nel browser: @workshop_url@/map.html

source: A map with a slider widget to control layer opacity.
it_it: Una mappa con un widget slider per controllarne l'opacità.

source: Bonus Task
it_it: Attività bonus

source: Find the Slider widget in the Ext JS documentation. Locate the configuration option that allows you to specify a set of intervals for setting the slider value. Experiment with adding a set of intervals to the slider. Configure the slider to restrict the range of opacity values that can be set.
it_it: Trovare il widget dello slider nella documentazione ExtJS. Individuare l'opzione di configurazione che permette di specificare un insieme di intervalli per impostare il valore dello slider. Sperimentare aggiungendo un insieme di intervalli al widget. Configurare lo slider per restringere l'intervallo dei valori di opacità che possono essere impostati.

source: With a functioning layer opacity slider in your application, you're ready to move on to :ref:`working with windows <openlayers.integration.ext-window>`.
it_it: Dopo aver appreso il funzionamento di uno slider di opacità per un layer , siamo in grado di spostarci a :ref:`lavorare con le finestre <openlayers.integration.ext-window>`.
