Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/integration/ext-window.po
Languages: it_it

source: The Ext JS Window
it_it: La finestra ExtJS

source: Ext JS provides windows with behavior and looks familiar to desktop application developers. The theme for an Ext based application is moderately configurable, though developing custom themes can be labor-intensive. Using Ext windows to display map related information gives your application a well integrated feel if you are using Ext widgets for non-map related parts of your application.
it_it: ExtJs prevede un aspetto con dei comportamenti molto simili alle applicazioni desktop. Il tema di un'applicazione basata su ExtJS è in parte configurabile sebbene sviluppare dei temi personalizzati richieda del tempo. Usare finestre ExtJS per visualizzare informazioni su mappa rende l'applicazione ben integrata con le altre parti componenti del sistema che state sviluppando.

source: An Ext window can be created with no existing markup. The following code creates a modeless window and opens it.
it_it: Una finestra Ext può essere creata senza bisogno di un HTML esistente. Il codice seguente crea una finestra non modale e la apre.

source: Ext builds complex elements based on containers with one or more items. The window above contains a panel element that was created from the string ``"Hello!"`` Using the above technique, windows can be created to display information about features on your map.
it_it: Ext consente di costruire elementi complessi basati su contenitori con uno o più componenti. La finestra sopra contiene un pannello che è stata creata da una stringa ``"Hello!"``. Usando la tecnica precedente possono essere create le finestre per visualizzare le informazioni riguardanti le feature sulla mappa.

source: Displaying Feature Information in a Window
it_it: Visualizzare le informazioni sulla feature in una finestra

source: Tasks
it_it: Attività

source: At the end of the :ref:`previous section <openlayers.integration.ext-slider>`, you should have something like the code below in your ``map.html`` file. Open this file in your text editor and confirm the contents are similar to the following:
it_it: Al termine della :ref:`precedente sezione <openlayers.integration.ext-slider>`, dovreste avere qualcosa simile al codice sotto nel file ``map.html``. Aprire questo file nel vostro editor di testo a verificare che il contenuto sia piuttosto simile a quello seguente:

source: To this example, we'll be adding an ``OpenLayers.Control.SelectFeature`` control so that the user can select a feature. In your map initialization code, add the following `after` the creation of your ``buildings`` layer:
it_it: In questo esempio aggiungeremo un controllo ``OpenLayers.Control.SelectFeature`` cosicché l'utente possa selezionare una feature. Nel vostro codice di inizializzazione aggiungere `dopo` la creazione del layer ``buildings`` il blocco di codice seguente:

source: Next we need to create a listener for the ``featureselected`` event on our ``buildings`` layer. We'll create a window populated with feature information when the user selects a feature (by clicking on it with the mouse). In addition, we want to destroy the window when a feature is unselected. We can do this by listening for the ``featureunselected`` event. Insert the following in your map initialization code somehere `after` the creation of the ``buildings`` layer:
it_it: Successivamente abbiamo bisogno di creare un listener per l'evento ``featureselected`` sul nostro layer ``buildings``. Creeremo un finestra popolata con le informazioni della feature quando l'utente seleziona una feature (facendo click su di essa con il mouse). Inoltre vogliamo distruggere la finestra quando la feature non è più selezionata. Per far questo dobbiamo mettere l'applicazione in ascolto sull'evento ``featureunselected``. Inserite il blocco di codice seguente `dopo` la creazione del layer ``buildings`` nel codice di inizializzazione della mappa:

source: Save your changes to ``map.html`` and open the page in your browser: @workshop_url@/map.html
it_it: Salvare le modifiche al file ``map.html`` e aprire la pagina nel browser: @workshop_url@/map.html

source: A map that displays feature information in a window.
it_it: Una mappa che visualizza le informazioni di una feature in una finestra.

source: Bonus Tasks
it_it: Attività bonus

source: Generally speaking, setting element styles in code is bad. Ext allows for easy style declarations in the component configuration with the ``style`` and ``bodyStyle`` properties. In addition, Ext makes it easy to set CSS class names for components via the ``cls`` property. Experiment with adding a class name to the window contents and using declarations in your CSS instead of the ``bodyStyle`` configuration option above.
it_it: In generale impostare gli stile degli elementi nel codice non va bene. Ext permette facile dichiarazioni di stile nella configurazione del componente con le proprietà ``style`` e ``bodyStyle``. Inoltre Ext rende facilmente possibile di impostare classi CSS per i componenti attraverso la proprietà ``cls``. Sperimentare aggiungendo classi ai contenuti delle finestre e usando dichiarazioni di stile in un vostro CSS al posto dell'opzione di configurazione ``bodyStyle`` di prima.

source: Find the ``Ext.Window`` constructor in the Ext documentation. Change the configuration of the windows in your ``map.html`` example to make them modal windows. Your application will not receive browser events until the window is closed.
it_it: Trovare il costruttore ``Ext.Window`` nella configurazione Ext. Cambiare la configurazione delle finestre nel vostro esempio ``map.html`` per renderle modali. La vostra applicazione non riceverà eventi del browser fino a che la finestra è chiusa.
