Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/integration/jqui-slider.po
Languages: it_it

source: The jQuery UI Slider
it_it: Lo slider jQuery UI

source: The jQuery UI slider widget creates a draggable handle that can be configured to return a value based on the handle position. Raster layers in OpenLayers provide a ``setOpacity`` method that controls the image opacity and accepts values between 0 (totally transparent) and 1 (totally opaque). A jQuery UI slider widget is a user-friendly way to set layer opacity in an OpenLayers map.
it_it: Il widget dello slider jQuery UI crea un controllo muovibile che può essere configurato per ritornare un valore in base alla posizione dello stesso. I layer raster in OpenLayers prevedono un metodo ``setOpacity``che definisce l'opacità dell'immagine e accetta valori tra 0 (totalmente trasparente) e 1 (totalmente opaca). Il widget costituisce un modo molto accattivante e facile per impostare l'opacità di layer in una mappa.

source: A jQuery UI slider can be created with something like the following markup.
it_it: Uno slider jQuery UI può essere creato con qualcosa di simile al seguente HTML.

source: To give these elements the slider behavior, you would run the following code.
it_it: Per attribuire il comportamento dello slider a questi elementi si dovrebbe eseguire il codice seguente.

source: The ``jQuery`` function is also exported under the alias ``$``. In the examples below, you'll see the use of the ``$`` function. This is entirely equivalent to using the ``jQuery`` function.
it_it: La funzione ``jQuery`` è esportata anche con l'alias ``$``. Negli esempi di sotto vedrai come usare la funzione ``$``. Ciò è altrettanto equivalente ad utilizzare la funzione ``jQuery``.

source: Using a Slider to Control Layer Opacity
it_it: Usare uno Slider per controllare l'opacità di un layer

source: We'll start with a working example that displays one :abbr:`WMS (OGC Web Map Service)` layer and one vector layer with features from a :abbr:`WFS (OGC Web Feature Service)`.
it_it: Cominceremo con un esempio funzionante che visualizza un layer :abbr:`WMS (OGC Web Map Service)` ed un vettoriale con feature provenienti da un :abbr:`WFS (OGC Web Feature Service)`.

source: Tasks
it_it: Attività

source: Open your text editor and save the following as ``map.html`` in the root of your workshop folder:
it_it: Aprire il vostro editor di testo e salvare come file ``map.html`` nella radice della directory del workshop:

source: Next we need to pull in the jQuery resources that our widgets will require. Add the following markup to the ``<head>`` of your ``map.html`` document:
it_it: Successivamente abbiamo bisogno di importare le risorse jQuery richieste dalla nostra widget. Aggiungere il codice HTML seguente nell'``<head>`` del vostro documento ``map.html``:

source: The slider widget needs some markup to start with. Insert the following in the ``<body>`` of your ``map.html`` page, just after the map viewport, in order to create a container for the slider:
it_it: Il widget dello slider ha bisogno di blocco di codice per poter essere eseguito. Inserite il blocco seguente nel ``<body>`` della vostra pagina ``map.html``, proprio dopo il viewport della mappa, in modo da creare un container per lo slider:

source: One bit of preparation before finalizing the code is to style the slider container. In this case, we'll make the slider as wide as the map and give it some margin. Insert the following style declarations into the ``<style>`` element within the ``<head>`` of your document:
it_it: Una piccola aggiunta prima di terminare il codice potrebbe consistere nel dare uno stile al container dello slider. In questo caso, faremo lo slider largo quanto la mappa e gli daremo un certo margine. Inserite le seguenti dichiarazioni di stile nell'elemento ``<style>`` all'interno dell'``<head>`` del documento:

source: Having pulled in the required jQuery resources, created some markup for the widget, and given it some style, we're ready to add the code that creates the slider widget. In the ``<script>`` element that contains your map initialization code, insert the following to create the slider widget and set up a listener to change your layer opacity as the slider value changes:
it_it: Dopo aver inserito la libreria richiesta, aggiungendo del codice HTML per il widget e dandogli un pò di stile siamo pronti a scrivere il codice che definisce il comportamento dello slider. Nell'elemento ``<script>`` che contiene il codice di inizializzazione della mappa, inseriamo il blocco che crea il widget e impostiamo un listenere per cambiare l'opacità del layer non appena cambia il valore:

source: Save your changes to ``map.html`` and open the page in your browser: @workshop_url@/map.html
it_it: Salvare le modifiche a ``map.html`` e aprire la pagina nel browser: @workshop_url@/map.html

source: A map with a slider widget to control layer opacity.
it_it: Una mappa con uno slider per regolare l'opacità di un layer.

source: Bonus Task
it_it: Attività Bonus

source: In the jQuery documentation, find the options for the slider function that allow you to specify a number of incremental steps within the slider range. Experiment with adding discrete intervals to the slider range. Modify the end values of the range to restrict opacity settings.
it_it: Nella documentazione jQuery, cercate le opzioni per la funzione slider che permette di specificare un numero di passi ad incremento all'interno dell'intervallo dello slider. Sperimentare aggiungendo intervalli discreti al range dello slider. Modificare il valori finali del range per restringere le impostazioni di opacità.

source: Having mastered the jQuery UI slider, you're ready to start working with :ref:`dialogs <openlayers.integration.jqui-dialog>`.
it_it: Dopo aver appreso riguardo allo slider jQuery UI, possiamo spostarci a lavorare con le finestre di :ref:`dialogo <openlayers.integration.jqui-dialog>`.
