Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/integration/jqui-dialog.po
Languages: it

source: The jQuery UI Dialog
it: La finestra Dialog jQuery UI

source: If you are adding a map to a larger website, and you are already using jQuery UI for interface components, it makes good sense to create "popups" for your map that will be integrated with the style of the rest of your site. The jQuery UI ``dialog`` function provides a flexible way to produce themeable dialogs that serve a variety of purposes.
it: Se state aggiungendo una mappa ad un sito Web più largo e state già utilizzando jQuery UI per l'interfaccia dei componenti allora avrebbe molto senso creare dei "popup" per la mappa che si integrino con lo stile restante di tutto il sito. La funzione ``dialog`` di jQuery UI consente un modo flessibile di produrre finestre di dialogo tematizzabili che possono servire a parecchi scopi.

source: The :ref:`previous example <openlayers.integration.jqui-slider.example` started with existing markup and used the ``jQuery`` function to select and modify DOM elements. The ``jQuery`` function can also be used to create elements given a string of HTML.
it: Il :ref:`precedente esempio <openlayers.integration.jqui-slider.example` era iniziato con HTML esistente a cui era stata aggiunta una funzione ``jQuery`` per selezionare e modificare gli elementi del DOM. La stessa funzione può anche essere usata per creare elementi data una stringa HTML.

source: The code below creates a ``<div>`` element and turns it into a modeless dialog:
it: Il codice sotto crea un elemento ``<div>`` e lo trasforma in una finestra dialog:

source: This technique is used in the tasks below to create dialogs populated with information from a feature's attribute values.
it: Questa è la tecnica utilizzata negli esempi sotto per creare finestre di dialogo popolate con le informazioni degli attributi delle feature.

source: Displaying Feature Information in a Dialog
it: Visualizzare informazioni delle feature in una finestra Dialog

source: Tasks
it: Attività

source: At the end of the :ref:`previous section <openlayers.integration.jqui-slider>`, you should have something like the code below in your ``map.html`` file. Open this file in your text editor and confirm the contents are similar to the following:
it: Al termine della :ref:`sezione precedente <openlayers.integration.jqui-slider>`, dovresti aver ottenuto qualcosa come nel file ``map.html`` sotto. Aprire il file in un editor di testo e verificare che i contenuti siano simili a:

source: To this example, we'll be adding an ``OpenLayers.Control.SelectFeature`` control so that the user can select a feature. In your map initialization code, add the following `after` the creation of your ``buildings`` layer:
it: In questo esempio aggiungeremo un controllo ``OpenLayers.Control.SelectFeature`` in modo tale che l'utente possa selezionare una feature. Nel codice di inizializzazione della mappa, aggiungere il codice seguente `after` dopo la creazione del layer ``buildings``:

source: Next we need to create a listener for the ``featureselected`` event on our ``buildings`` layer. We'll create a dialog that populates with feature information, when the user selects a feature by clicking on it with the mouse. In addition, we want to remove the dialog when a feature is unselected. We can do this by listening for the ``featureunselected`` event. Insert the following in your map initialization code somewhere `after` the creation of the ``buildings`` layer:
it: Successivamente dobbiamo creare un listenere per l'evento ``featureselected`` sul nostro layer ``buildings``. Creeremo una finestra di dialogo che viene popolata dalle informazioni della feature quando l'utente seleziona una feature facendovi click con il mouse. Inoltre vogliamo rimuovere la finestra quando la feature non è più selezionata. Possiamo fare tutto ciò intercettando l'evento ``featureunselected``. Inserite da qualche parte nel vostro codice di inizializzazione della mappa `dopo` la creazione del layer ``buildings`` il blocco seguente:

source: Save your changes to ``map.html`` and open the page in your browser: @workshop_url@/map.html
it: Salvare le modifiche a ``map.html`` e aprire la pagina nel browser: @workshop_url@/map.html

source: A map that displays feature information in a dialog.
it: Una mappa che visualizza informazioni sulle feature in una finestra di dialogo.

source: Bonus Tasks
it: Attività Bonus

source: Find the appropriate documentation to determine how to make the feature dialog with modal behavior. Create a modal dialog for displaying feature information so a user will need to close it before interacting with anything else in the application.
it: Trovate l'appropriata documentazione per determinare come fare una finestra di dialogo della feature con un comportamento modale. Create tale finestra per visualizzare le informazioni della feature in maniera che l'utente dovrà chiuderla prima di interagire con qualsiasi altra cosa nell'applicazione.

source: Experiment with editing the style declarations in the head of the page in order to change the look of the displayed information. You can use the jQuery ``addClass`` function to add a class name to an element before calling ``dialog()``.
it: Sperimentare con la modifica delle dichiarazioni di stile all'inizio della pagina in maniera tale da cambiare il look delle informazioni visualizzate. E' possibile usare la funzione ``addClass`` di jQuery per aggiungere una classe ad un elemento prima di chiamare ``dialog()``.
