Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/basics/dissect.po
Languages: it_it

source: Dissecting Your Map
it_it: Anatomia della mappa

source: As demonstrated in the :ref:`previous section <openlayers.basics.map>`, a map is generated by bringing together :ref:`markup <openlayers.basics.dissect.markup>`, :ref:`style declarations <openlayers.basics.dissect.style>`, and :ref:`initialization code <openlayers.basics.dissect.code>`. We'll look at each of these parts in a bit more detail.
it_it: Come dimostrato nella :ref:`precedente sezione <openlayers.basics.map>`, una mappa è generata mettendo insieme un :ref:`markup <openlayers.basics.dissect.markup>`, una :ref:`dichiarazione di stile <openlayers.basics.dissect.style>`, e :ref:`inizializzando il codice <openlayers.basics.dissect.code>`.

source: Map Markup
it_it: Markup della mappa

source: The markup for the map in the :ref:`previous example <openlayers.basics.map.example>` generates a single document element:
it_it: Il markup della mappa nel :ref:`precedente esempio <openlayers.basics.map.example>` genera un singolo elemento:

source: This ``<div>`` element will serve as the container for our map viewport. Here we use a ``<div>`` element, but the container for the viewport can be any block-level element.
it_it: Questo elemento ``<div>`` servirà come contenitore per il viewport della nostra mappa. Vedremo come usare un elemento ``<div>``, ma il contenitore per il viewport può essere qualsiasi elemento block-level.

source: In this case, we give the container an ``id`` attribute so we can reference it easily elsewhere.
it_it: In questo caso diamo al contenitore un attributo ``id`` così che possiamo facilmente richiamarlo altrove.

source: Map Style
it_it: Stile della mappa

source: OpenLayers comes with a default stylesheet that specifies how map-related elements should be styled. We've explicitly included this stylesheet in the ``map.html`` page (``<link rel="stylesheet" href="openlayers/theme/default/style.css" type="text/css">``).
it_it: OpenLayer è equipaggiato con uno stylesheet di default che specifica come gli elementi relativi alla mappa debbano essere stilizzati. Lo includiamo esplicitamente nella pagina ``map.html`` (``<link rel="stylesheet" href="openlayers/theme/default/style.css" type="text/css">``).

source: OpenLayers doesn't make any guesses about the size of your map. Because of this, following the default stylesheet, we need to include at least one custom style declaration to give the map some room on the page.
it_it: OpenLayers non prende preventivamente in considerazione la grandezza della mappa. Per questo, analizzando lo stile di base, dobbiamo includere almeno una dichiarazione nel nostro stile che dia alla mappa un certo spazio nella pagina.

source: In this case, we're using the map container's ``id`` value as a selector, and we specify the width (``512px``) and the height (``256px``) for the map container.
it_it: In questo caso, stiamo utilizzando il valore ``id`` del contenitore della mappa come selettore e poi specifichiamo la sua larghezza (``512px``) e la sua altezza (``256px``)

source: The style declarations are directly included in the ``<head>`` of our document. In most cases, your map related style declarations will be a part of a larger website theme linked in external stylesheets.
it_it: Le dichiarazioni di stile sono direttamente incluse nell'``<head>`` del nostro documento. Nella maggior parte dei casi, le dichiarazioni relative allo stile saranno parte del tema di un sito Web collegato in fogli di stile esterni.

source: OpenLayers enforces zero margin and padding on the element that you use for the viewport container. If you want your map to be surrounded by some margin, wrap the viewport container in another element with margin or padding.
it_it: OpenLayers imposta forzatamente a zero il margine ed il pudding sull'elemento che usiamo per il contenitore del viewport. Se volessimo una mappa contornata da qualche margine dovremmo inglobarlo in un altro elemento che abbia margine e pudding.

source: Map Initialization
it_it: Inizializzazione delle mappa

source: The next step in generating your map is to include some initialization code. In our case, we have included a ``<script>`` element at the bottom of our document ``<body>`` to do the work:
it_it: Il prossimo passo nella generazione della mappa includerà l'inizializzazione del codice. Nel nostro caso abbiamo incluso un elemento ``<script>`` alla fine della sezione ``<body>`` del documento per realizzare il nostro obiettivo:

source: The order of these steps is important. Before the our custom script can be executed, the OpenLayers library must be loaded. In our example, the OpenLayers library is loaded in the ``<head>`` of our document with ``<script src="openlayers/lib/OpenLayers.js"></script>``.
it_it: L'ordine con cui compiere questi passi è importante. Prima che il nostro script possa essere eseguito la libreria OpenLayers deve essere caricata. Nel nostro esempio viene caricata nella sezione ``<head>`` con la direttiva ``<script src="openlayers/lib/OpenLayers.js"></script>``.

source: Similarly, our custom map initialization code (above) cannot run until the document element that serves as the viewport container, in this case ``<div id="map-id"></div>``, is ready. By including the initialization code at the end of the document ``<body>``, we ensure that the library is loaded and the viewport container is ready before generating our map.
it_it: Analogamente, l'inizializzazione della nostra mappa (di prima) non può essere eseguita finché l'elemento document che funge da viewport, nel nostro caso ``<div id="map-id"></div>``, non è pronto. Includendo il codice di inizializzazione della mappa alla fine del markup ``<body>``, possiamo stare certi che la libreria è stata caricata e il contenitore viewport sia pronto a servire la nostra mappa.

source: Let's look in more detail at what the map initialization script is doing. The first line of our script creates a new ``OpenLayers.Map`` object:
it_it: Diamo uno sguardo più ravvicinato a come lo script di inizializzazione della mappa opera. La prima linea del nostro script crea un nuovo oggetto ``OpenLayers.Map``:

source: We use the viewport container's ``id`` attribute value to tell the map constructor where to render the map. In this case, we pass the string value ``"map-id"`` to the map constructor. This syntax is a shortcut for convenience. We could be more explicit and provide a direct reference to the element (e.g. ``document.getElementById("map-id")``).
it_it: Utilizziamo il valore dell'attributo ``id`` del viewport per dire al costruttore della mappa dove visualizzarla. In tal caso passiamo la stringa ``"map-id"`` al costruttore della mappa. Questa sintassi è una abbreviazione di convenienza. Avremmo potuto più esplicitamente utilizzare un riferimento diretto all'elemento (Es. ``document.getElementById("map-id")``).

source: The next several lines create a layer to be displayed in our map:
it_it: Le prossime linee di codice creano un layer da visualizzare nella mappa:

source: Don't worry about the syntax here if this part is new to you. Layer creation will be covered in another module. The important part to understand is that our map view is a collection of layers. In order to see a map, we need to include at least one layer.
it_it: Non preoccupatevi ora della sintassi se dovesse essere non ancora familiare. La creazione di un layer sarà oggetto di discussione in un altro modulo. E' importante capire in questo momento che la vista della nostra mappa è una collezione di layer. Per vedere la mappa dobbiamo includere almeno un layer.

source: The final step is to set the geographical limits (xmin, ymin, xmax, ymax) of the map display. This *extent* specifies the minimum bounding rectangle of a map area. There are a number of ways to specify the initial extent. In our example, we use a simple request to zoom to the maximum extent. By default, the maximum extent is the world in geographic coordinates:
it_it: Il passo finale consiste nella configurazione dei limiti geografici (xmin, ymin, xmax, ymax) della mappa visualizzata. L'*extent* specifica il minimo rettangolo di contenimento dell'area della mappa. Ci sono diversi modi di specificare l'estensione iniziale. Nel nostro esempio utilizzeremo una semplice richiesta di zoom all'estensione massima. Di base la massima estensione è costituita dal mondo in coordinate geografiche: .

source: You've successfully dissected your first map! Next let's :ref:`learn more <openlayers.basics.resources>` about developing with OpenLayers.
it_it: Hai completato con successo l'analisi della costruzione di una prima mappa! Nel prossimo paragrafo :ref:`vedremo alcune <openlayers.basics.resources>` per sviluppare con OpenLayers.
