Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/basics/resources.po
Languages: it_it

source: OpenLayers Resources
it_it: Risorse OpenLayers

source: The OpenLayers library contains a wealth of functionality. Though the developers have worked hard to provide examples of that functionality and have organized the code in a way that allows other experienced developers to find their way around, may users find it a challenge to get started from scratch.
it_it: La libreria OpenLayers è ricca di funzionalità. Sebbene gli sviluppatori abbiano lavorato a lungo per fornire esempi e hanno organizzato in codice in modo da permettere a chiunque con un buona esperienza alle spalle di trovare il miglior modo di utilizzarla, in generale partire da zero potrebbe essere un ardua sfida.

source: Learn by Example
it_it: Imparare attraverso gli esempi

source: New users will most likely find diving into the OpenLayer's example code and experimenting with the library's possible functionality the most useful way to begin.
it_it: I nuovi utenti troveranno più probabilmente utilissimo approfondire il codice degli esempi e sperimentare il più possibile le funzionalità della libreria per cominciare ad utilizzarla.

source: Browse the Documentation
it_it: Navigare attraverso la documentazione

source: For further information on specific topics, browse the growing collection of OpenLayers documentation.
it_it: Per ulteriori informazioni su specifici argomenti consulta l'ampia raccolta di documentazione OpenLayers.

source: Find the API Reference
it_it: Trova i riferimenti alle API

source: After understanding the basic components that make-up and control a map, search the API reference documentation for details on method signatures and object properties.
it_it: Dopo aver capito i componenti base che costituiscono e controllano una mappa, cerca nella documentazione delle API per approfondire i metodi e le proprietà degli oggetti.

source: Join the Community
it_it: Partecipa alla Community

source: OpenLayers is supported and maintained by a community of developers and users like you. Whether you have questions to ask or code to contribute, you can get involved by signing up for one of the mailing lists and introducing yourself.
it_it: OpenLayers è supportato e mantenuto da una comunità di sviluppatori e utenti come voi. Se avete domande da fare o volete contribuire al codice potete rendervi disponibili su una delle mailing list del progetto.

source: Users list http://lists.osgeo.org/mailman/listinfo/openlayers-users
it_it: Mailing list degli utenti http://lists.osgeo.org/mailman/listinfo/openlayers-users

source: Developers list http://lists.osgeo.org/mailman/listinfo/openlayers-dev
it_it: Mailing list degli sviluppatori http://lists.osgeo.org/mailman/listinfo/openlayers-dev
