Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/index.po
Languages: it

source: 2013 OpenLayers 2 Workshop
it: WorkShop OpenLayers 2 del 2013

source: Welcome to the **OpenLayers Workshop**. This workshop is designed to give you a comprehensive overview of OpenLayers as a web mapping solution. The exercises assume that you have set up a local GeoServer with the workshop data as described in the :doc:`setup` page.
it: Benvenuti al **Workshop su OpenLayers**. Questo tutoria è stato realizzato per darvi una comprensiva infarinatura sui concetti della libreria OpenLayers come soluzione per applicazioni Web basate su mappe. Gli esercizi che saranno proposti assumono che sia stata preparata una installazione di GeoServer locale con i dati che sono descritti nella pagina :doc:`setup`.

source: This workshop is presented as a set of modules. In each module the reader will perform a set of tasks designed to achieve a specific goal for that module. Each module builds upon lessons learned in previous modules and is designed to iteratively build up the reader's knowledge base.
it: Il workshop è presentato con un'insieme di moduli. In ciascuno il lettore completerà una serie di attività per raggiungere determinati obiettivi legati allo specifico modulo. Ogni modulo è costruito in modo da consentire di mettere in pratica le lezioni imparate nei precedenti e costruire passo dopo passo le conoscenze di base del lettore.

source: The following modules will be covered in this workshop:
it: Saranno affrontati i seguenti moduli nel workshop:

source: Fundamentals
it: I fondamentali

source: Learn how to add a map to a webpage with OpenLayers.
it: Imparare ad aggiungere una mappa ad una pagina Web con OpenLayers.

source: Learn about raster and vector layers.
it: Imparare a conoscere i layer vettoriali e raster.

source: Learn about using map controls.
it: Imparare ad utilizzare i controlli della mappa.

source: Advanced Topics
it: Concetti avanzati

source: Explore vector layers in depth.
it: Approfondire i layer vettoriali.

source: Learn how to use OpenLayers with other JavaScript libraries.
it: Imparare ad utilizzare OpenLayers con altre librerie JavaScript.
