Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/setup.po
Languages: it

source: Workshop Setup
it: Inizio del Workshop

source: Prerequisites
it: Prerequisiti

source: This workshop requires that that PostgreSQL with PostGIS and GeoServer are installed on workshop machines. These instructions assume that the OpenGeo Suite installer was assumed to install both GeoServer and PostgreSQL. GeoServer and PostgreSQL should be running before starting the workshop. With the Suite install, these services can be started from the Suite Dashboard (on Windows, you'll also find items in the Start menu.) As noted below, deploy the workshop documentation before starting the Suite.
it: Questo workshop richiede che siano installati PostgreSQL con PostGIS e GeoServer. Si assume che sia stato utilizzato il pacchetto di installazione della OpenGeo Suite e che siano già installati GeoServer e PostgreSQL. Essi dovranno essere avviati prima di iniziare il workshop. I loro servizi possono essere lanciati dalla Dashboard della Suite (su Windows la troverete nel Menu Start.). Come noterete sotto sarebbe anche opportuno distribuire la documentazione del workshop sull'application server prima di avviare la Suite.

source: Deploying the Workshop Docs
it: Distribuire la documentazione del Workshop

source: Extract the ol_workshop.zip archive to the :file`webapps` directory in your Suite install. The location of this directory differs depending on your operating system.
it: Estrarre l'archivio ol_workshop.zip sulla directory :file`webapps` nella vostra installazione. La posizione di questa directory può dipendere dal sistema operativo in uso.

source: Windows: :file:`C:\\Program Files\\OpenGeo\\OpenGeo Suite\\webapps`
it: Su Windows: :file:`C:\\Program Files\\OpenGeo\\OpenGeo Suite\\webapps`

source: Mac OS X: :file:`/opt/opengeo/suite/webapps`
it: Su Mac OS X: :file:`/opt/opengeo/suite/webapps`

source: Move the extracted :file:`ol_workshop` directory into your :file:`webapps` directory **before** starting the Suite.
it: Spostare la directory :file:`ol_workshop` estratta dall'archivio in :file:`webapps` **prima** di avviare la Suite.

source: Test the Setup
it: Test delle impostazioni

source: Test GeoServer and Postgres Setup:
it: Test delle impostazioni di GeoServer e Postgres:

source: Start the OpenGeo Suite.
it: Avviare la OpenGeo Suite

source: Load @geoserver_url@/ in a browser. You should see GeoServer's welcome screen.
it: Caricare la URL @geoserver_url@/ nel browser. Dovrebbe apparire la pagina di benvenuto di GeoServer.

source: Navigate to the layers preview page. You should be able to see the medford layers listed in the table.
it: Navigare alla pagina di anteprima dei layer. Dovreste essere in grado di vedere il layer medford nella lista che appare.

source: Click on the OpenLayers preview link for the ``medford`` layer. You should see some elevation data with infrastructure data over it.
it: Fare click sul collegamento all'anteprima OpenLayers del layer ``medford``. Dovreste poter vedere dei dati di elevazione con dati infrastrutturali sopra.

source: Test Workshop Docs:
it: Test della documentazione del Workshop:

source: Load @workshop_url@/doc/ in a browser. You should see a the intro page for the workshop docs with links to lead you through the workshop.
it: Caricare la URL @workshop_url@/doc/ nel browser. Dovreste poter visualizzare una pagina introduttiva per il workshop con i link che vi guideranno ai successivi capitoli.
