Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/controls/overview.po
Languages: it_it

source: Creating an Overview Map
it_it: Creare una mappa di overview

source: Online maps often contain a smaller *overview map* that displays the extent of the larger map. In OpenLayers, this is possible using the ``OpenLayers.Control.OverviewMap`` control.
it_it: Di solito le mappe online contengono una piccola *mappa di overview" che che visualizza l'estensione completa della mappa a prescindere dallo zoom. In OpenLayers questo è possibile grazie al controllo ``OpenLayers.Control.OverviewMap``.

source: Let's create a map with a single layer and then add an overview map control.
it_it: Creiamo una mappa con un singolo layer e poi aggiungiamoci un controllo di overview.

source: Tasks
it_it: Attività

source: Open a text editor and save the following page as ``map.html`` in the root of your workshop directory:
it_it: Aprite un editor di testo e salvate la pagina seguente come ``map.html`` nella radice della directory del workshop:

source: Open the working map in your web browser to confirm things look good: @workshop_url@/map.html.
it_it: Aprite la mappa risultante in un browser Web e verificare che tutto sta funzionando correttamente: @workshop_url@/map.html.

source: We are now going to add an overview map with default options to confirm things are properly working. Somewhere in your map initialization code (after the creation of the ``map`` object), insert the following:
it_it: A questo punto andremo ad aggiungere una mappa di overview con le opzioni di base verificando che tutto continua a funzionare appropriatamente. Da qualche parte nel codice di inizializzazione della mappa (dopo la creazione dell'oggetto ``map``) inserite il seguente pezzo di codice:

source: Save your changes and refresh ``map.html`` in your browser: @workshop_url@/map.html
it_it: Salvare le modifiche e aggiornare il file ``map.html`` nel browser: @workshop_url@/map.html

source: To see the overview map in action, open the :guilabel:`plus sign` at right of the map viewport.
it_it: Per poter vedere la mappa di overview in azione aprite il :guilabel:`segno più` alla destra del viewport della mappa.

source: An overview map control inside the main map viewport.
it_it: Un controllo di overview nel viewport principale della mappa

source: Discussion
it_it: Discussione

source: The map in this example includes a few things you may not have seen before:
it_it: La mappa di questo esempio include alcune cose che potreste non aver mai visto:

source: First, we construct the map in a custom projection. The OpenLayers default is to construct maps in a geographic projection, with units in decimal degrees. Because of the nature of the Medford dataset, we define a ``projection`` more appropriate for this area (i.e., Oregon State Plane South). This change in projection also requires setting the map ``units`` to feet ("ft").
it_it: Per prima cosa abbiamo costruito la mappa in un sistema di proiezione custom. Di base OpenLayers è abituato a costruirla con una proiezione geografica con unità in gradi decimali. A causa della natura dei dati Medford definiamo una ``proiezione`` più appropriata per questa area (Es: Oregon State Plane South). Questa modifica nella proiezione richiede anche di impostare le ``unità`` della mappa a feet ("ft").

source: The second thing to note is the use of the ``restrictedExtent`` property. This optional property restricts map panning to the given bounds. The imagery data used by the ``medford`` layer is limited to these bounds. To keep users from panning off the edge of our base layer, we set the ``restrictedExtent`` to the bounds of the data.
it_it: La seconda cosa da notare è l'utilizzo della proprietà ``restrictedExtent``. Questa proprietà opzionale restringe il pan della mappa ad su un dato rettangolo di contenimento. Le immagini utilizzate dal layer ``medford`` sono vincolate a questi confini. Per far si che gli utenti spostino fuori il contorno del nostro layer di base impostiamo il valore della proprietà ``restrictedExtent`` al confine dei nostri dati.

source: The final set of custom options are related to map resolutions. By default, a map will be set up to view the entire world in two 256x256 tiles when all the way zoomed out. Since we want to focus on a very limited subset of the world, we set the ``maxResolution`` property. A value of 2.5 means 2.5 feet per pixel (since we set map units to feet). When users are zoomed all the way out, they will be seeing 2.5 feet per pixel. We also specify that we only want 5 zoom levels instead of the default 16 levels.
it_it: L'impostazione finale delle nostre opzioni personalizzate sono relative alla risoluzione della mappa. Di base una mappa viene impostata su una vista che contiene il mondo intero con tasselli 265x256 al minimo zoom. Poiché vogliamo riferirci ad una porzione molto limitata del mondo imposteremo la proprietà ``maxResolution``. Un valore di 2.5 assume il significato di 2.5 feet per pixel (dal momento che abbiamo impostato l'unità della mappa a feet). Quando gli utenti saranno al minimo zoom essi vedranno allora 2.5 feet per pixel. Specificheremo anche che vogliamo impostare 5 livelli di zoom invece dei classici 16 di base.

source: The overview map constructor also deserves a bit of discussion:
it_it: Il costruttore della mappa di overview necessità anche di un minimo approfondimento:

source: Like the custom ``map`` above, customization to the ``overview`` map control must also be specified. So, for every non-default property set for the main map, we need a corresponding property for the map created by the control.
it_it: Come per la personalizzazione dell'oggetto ``map`` anche nel caso dell'oggetto di controllo dell'``overview`` dobbiamo anch'esso specificarlo. Così, per ogni proprietà non di base impostata per la mappa principale, abbiamo bisogno di una proprietà corrispondente creata dal controllo.

source: We want ``projection``, ``units``, ``restrictedExtent`` and ``numZoomLevels`` to be the same for the overview map as well as the main map. However, in order for the overview map to zoom "farther out" we want a different ``maxResolution`` property. The appropriate values for your application can be determined by trial and error or calculations based on how much data you want to show (given the map size).
it_it: Vogliamo che ``projection``, ``units``, ``restrictedExtent`` e ``numZoomLevels`` siano gli stessi per l'overview così come per la mappa principale. Comunque per fare in modo che l'overview possa effettuare lo zoom "piuttosto indietro" dobbiamo impostare una differente proprietà ``maxResolution``. Il valori appropriati per la vostra applicazione possono essere determinati provando per tentativi o con calcoli basati su quanti dati volete visualizzare sulla mappa (data una certa grandezza).

source: Next we'll build upon our map to include a :ref:`scale bar <openlayers.controls.scaleline>`.
it_it: Successivamente costruiremo la nostra mappa includendo una :ref:`barra di scala <openlayers.controls.scaleline>`.
