Repository: boundlessgeo/workshops
Catalog: workshops/openlayers/src/doc/locale/*/LC_MESSAGES/controls/select.po
Languages: it_it

source: Selecting Features
it_it: Selezionare le feature

source: So far we have been using WMS to render raster images and overlay them in OpenLayers. We can also pull features as vectors and draw them on top of a base map. One of the advantages of serving vector data is that users can interact with the data. In this example, we create a vector layer where users can select and view feature information.
it_it: Finora abbiamo usato il WMS per visualizzare immagini raster e sovrapporle in mappe OpenLayers. Potremmo anche richiedere di farci restituire le feature come vettori e disegnarli sopra alla mappa di base. Uno dei vantaggi nel richiedere dati vettoriali è che l'utente può interagirci. In questo esempio creeremo un layer vettoriale dove gli utenti possono selezionare e visualizzare le informazioni associate alle feature.

source: Create a Vector Layer and a SelectFeature Control
it_it: Creare un layer vettoriale e un controllo SelectFeature

source: Tasks
it_it: Attività

source: Let's start with the working example from the :ref:`previous section <openlayers.controls.scaleline>`. Open ``map.html`` in your text editor and make sure it looks something like the following:
it_it: Cominceremo con l'esempio funzionante della :ref:`precedente sezione <openlayers.controls.scaleline>`. Aprite il file ``map.html`` nel vostro editor preferito e assicuratevi che assomigli a qualcosa del genere:

source: Next add a vector layer that requests the building footprints for Medford, Oregon. Because this data will be rendered client-side (i.e., by your browser), users can interact with its features. Somewhere in your map initialization (after the ``map`` object is created), add the following code to create a vector layer that uses the :abbr:`WFS (OGC Web Feature Service)` protocol:
it_it: Per prima cosa aggiungeremo un layer vettoriale che richiede le sezioni degli edifici per Medford in Oregon. Poiché questi dati verranno restituiti lato client (Es: dal vostro browser), gli utenti potrànno interagire con le feature. Da qualche parte nella inizializzazione della mappa (dopo che l'oggetto ``map`` è creato), aggiungerete il pezzo di codice seguente che utilizza il protocollo :abbr:`WFS (OGC Web Feature Service)` per creare un layer vettoriale:

source: With the ``buildings`` layer requesting and rendering building features, we can create a control that allows users to select buildings. In your map initialization code, add the following `after` the creation of your ``buildings`` layer:
it_it: Assieme alla richiesta e restituzione del layer ``buildings`` possiamo creare un controllo che permetta agli utenti di selezionare gli edifici. Sempre nella parte di inizializzazione della mappa aggiungete `dopo` la creazione del layer ``buildings`` il codice sotto:

source: Save your changes to ``map.html`` and open the page in your browser: @workshop_url@/map.html. To see feature selection in action, use the mouse-click to select a building:
it_it: Salvate le modifiche al file ``map.html`` e nel browser aprite la pagina: @workshop_url@/map.html. Per vedere in azione la selezione delle feature userete il click del mouse che selezionerà la forma degli edifici:

source: Using a control to select features from a vector layer.
it_it: Usare un controllo di selezione delle feature da un layer vettoriale

source: Displaying Building Information on Feature Selection
it_it: Visualizzare informazioni degli edifici sulla base della selezione delle feature

source: We can use layer events to respond to feature selection. This is useful for displaying specific feature information to the user. The ``featureselected`` event is triggered on a vector layer each time a feature is selected. Here we add a listener for this event that will display feature information below the map.
it_it: Potremmo anche usare gli eventi sul layer per rispondere alla selezione di ciascuna feature. Questo risulta utile per visualizzare specifiche informazioni per l'utente. L'evento ``featureselected`` è scatenato sul layer vettoriale ogni volta che viene selezionata una feature. Qui sotto aggiungiamo un listener per questo evento che visualizzerà le informazioni della feature nella mappa.

source: First we need to add an element to display the feature information. Open ``map.html`` in your text editor and insert the following markup into the ``<body>`` of your page.
it_it: Per prima cosa abbiamo bisogno di aggiungere un elemento per visualizzare le informazioni della feature. Apriamo sempre il file ``map.html`` in un editor e inseriamo il seguente markup nel ``<body>`` della pagina.

source: Next we add some style declarations so that the feature information output doesn't sit on top of the scale bar. Give your output element some margin, by adding the following within the ``<style>`` element:
it_it: Successivamente aggiungiamo qualche dichiarazione di stile in modo che l'output delle informazioni restituite non finisca troppo sopra alla barra della scala. Diamo all'elemento di output un qualche margine aggiungendo dentro all'elemento ``<style>`` il codice seguente:

source: Finally, we create a listener for the ``featureselected`` event that will display feature information in the output element. Insert the following in your map initialization code after the creation of the ``buildings`` layer:
it_it: Infine creiamo un listener per l'evento ``featureselected`` che visualizzerà le informazioni delle feature nell'elemento di output. Inseriamo nell'inizializzazione della mappa proprio sotto alla creazione del layer ``buildings`` questo pezzo di codice:

source: Save your changes and refresh the ``map.html`` page in your browser: @workshop_url@/map.html
it_it: Salvare le modifiche e ricaricare nel browser la pagina ``map.html``: @workshop_url@/map.html

source: Displaying building information on feature selection.
it_it: Visualizzare informazioni sugli edifici alla selezione di una feature
